function Announcement() {
    return (
        <div>
            <h4>📢小公告</h4>
            <p>【Bug】目前 ios 手機用戶點擊輸出課表的按鈕會無法正確輸出，請暫時使用電腦。原因似乎和 ios 的檔案系統和瀏覽器 bug 有關。</p>
            <p>【新增】現在 Local storage 會儲存使用數據，也就是說瀏覽器會暫存你的選課結果</p>
            <p>【提醒】盡量善用篩選器，不然畫面元素過多會造成卡頓。</p>
            <p>
                【提醒】點擊螢幕右下角的 
                <b className="ms-1 me-1">
                <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" fill="currentColor" className="bi bi-bookmark-star" viewBox="0 0 16 16">
  <path d="M7.84 4.1a.178.178 0 0 1 .32 0l.634 1.285a.178.178 0 0 0 .134.098l1.42.206c.145.021.204.2.098.303L9.42 6.993a.178.178 0 0 0-.051.158l.242 1.414a.178.178 0 0 1-.258.187l-1.27-.668a.178.178 0 0 0-.165 0l-1.27.668a.178.178 0 0 1-.257-.187l.242-1.414a.178.178 0 0 0-.05-.158l-1.03-1.001a.178.178 0 0 1 .098-.303l1.42-.206a.178.178 0 0 0 .134-.098L7.84 4.1z"/>
  <path d="M2 2a2 2 0 0 1 2-2h8a2 2 0 0 1 2 2v13.5a.5.5 0 0 1-.777.416L8 13.101l-5.223 2.815A.5.5 0 0 1 2 15.5V2zm2-1a1 1 0 0 0-1 1v12.566l4.723-2.482a.5.5 0 0 1 .554 0L13 14.566V2a1 1 0 0 0-1-1H4z"/>
</svg>
                書籤按鈕 
                </b>
                可以查看或移除選擇的課程。
            </p>
            <hr />
            <p className="mb-0">如果有什麼問題，歡迎直接寄信到 <a href='mailto:tony20020507@gmail.com'>tony11306 的信箱</a></p>
            <p className='mb-0'>或者可以到我的巴哈姆特小屋文章留言 <a href='https://home.gamer.com.tw/artwork.php?sn=5342422'>【程式作品】嘉義大學選課輔助器</a></p>
        </div>
    )
}

export default Announcement